// 4)ფუნქციამ მიიღოს სამი ქულა(პარამეტრი) ---> (p1, p2, p3).
// შეკრიბეთ ეს ქულები.
// იპოვოს საშუალო და შეინახხეთ ცვლადში
// შემდეგ --> if else ით შეამოწმეთ
// თუ  საშუალო ≥ 51 → "დადებითი შედეგი".
// სხვა შემთხვევაში → "უარყოფითი შედეგი".

function points(p1, p2, p3){
    let sum=p1+p2+p3
    let average=sum/3
    if(average>=51){
        alert('დადებითი შედეგი')
    }else{
        alert('უარყოფითი შედეგი')
    }
}

points(22,323,4)
points(2342,323,4)
points(23442,32343,4)
points(23243242,3233324,-4)