// 1)შექმენით HTML გვერდი <p> ელემენტით. დაწერეთ JavaScript ფუნქცია, რომელიც გამოძახებისას შეცვლის <p> ელემენტის ტექსტს და დააწერს "Hello, DOM!".

let pTag=document.getElementById('pTag')

function clickp(){
    pTag.textContent='Hello, DOM!'
}

pTag.addEventListener('click', clickp)



// 6)შექმენით HTML გვერდი 3 <button> ელემენტით, თითოეული განსხვავებული id-ით (btn1, btn2, btn3).
// -----დაწერეთ JavaScript, რომელიც თითოეული ღილაკის დაჭერისას:
// -----შეცვლის <h2> ელემენტის ტექსტს "Button X clicked!" (X = 1,2,3)
// -----შეცვლის <h2> ფონს განსხვავებულ ფერად, რაც დამოკიდებულია დაჭერილ ღილაკზე.

// 7)შექმენით HTML გვერდი <div id="container"></div> და <button> ელემენტით.
// -----ყოველი დაჭერისას შექმენით ახალი <p> ელემენტი ტექსტით "Item X" (X = დამატებული ელემენტების რაოდენობა).
// -----დაამატეთ ახალი ელემენტი container-ში.