# 3) # დაატრიალეთ ციკლი while loop ის გამოყენებით რომელიც დაგვიბეჭდავს 30 დან 70მდე ლუწ რიცხვებს if ის გარეშე
i=30
while i!=70:
    print(i)
    i= i + 2

# დაატრიალეთ ციკლი while loop ის გამოყენებით რომელიც დაგვიბეჭდავს 0 დან 30მდე კენტ რიცხვებს if ის გარეშე
    
i=1
while i<30:
    print(i)
    i=i + 2

# დაატრიალეთ ციკლი while loop ის გამოყენებით რომელიც დაგვიბეჭდავს 5 დან 50მდე ხუთის ჯერად რიცხვებს if ის გამოყენებით

i=0
while i!=55:
    if i%5==0:
        print(i)
    i= i + 1
    

# დაატრიალეთ ციკლი while loop ის გამოყენებით რომელიც დაგვიბეჭდავს 5 დან 50მდე ხუთის ჯერად რიცხვებს if ის გარეშე
i=0
while i !=55:
    print(i)
    i= i + 5

    # დაატრიალეთ ციკლი while loop ის გამოყენებით რომელიც დაგვიბეჭდავს 
    # 10 დან 50მდე რიცხვებს და გვერდით მიუწერს ლუწია თუ კენტი
i=0
while i !=50:
    if i%2==0:
       print(i ,"even")
    else:
        print(i,'odd')
    i= i+1