# 6) თქვენ დაგპატიჟეს პატარა ბავშვის დაბადების დღეზე გასართობ ცენტრში, თქვენთან ერთად ამ გასართობ ცენტრში დაპატიჟეს 10 ადამიანი და ამ 10 ადამიანიდან ერთ ერთი ნიკოლოზია. ნიკოლოზს უთხრეს რომ მას შეუძლია ბავშებთან ერთად გაერთოს თუ ის ფეხსაცმელებს გაიხდის და ქურთუკს საკიდზე ჩამოკიდებს (True და False-ს გამოყენება დაგჭირდებათ). თქვენი მიზანია გაარკვიოთ ნიკოლოზმა შეასრულა ეს წესები თუ არა, ანუ შეუძლია თუ არა მას ბავშებთან ერთად გართობა.
answer = input("Did you take off your shoes and jacket?")
if answer == "yes":
    print(True)
elif answer == "No":
    print(False)
else:
    print("Idont understand you")