# 1) შექმენით ფუნქცია რომელიც გამოთვლის ამ ფუნქციაზე გადაცემულ რიცხვამდე არსებული ყველა რიცხვის ჯამს 1-იდან. საბოლოოდ გამოიძხეთ ფუნქცია 3 სხადასხვა რიცხაზვე და შეამოწმეთ თუ როგორ მუშაობს

def count(num1,num2):
    x=0
    for i in range(num1, num2):
        x+=i
    print(x)
    
    
    
count(1,3)
count(1,10)
count(1,5222)



# 2) შექმენით ფუნქცია რომელიც მიიღებს 2 პარამეტრს და შემდეგ დაბეჭდავს მათ ჯამს, გამოიძახეთ ფუნქცია 5-ჯერ. კომენტარებით დაწერეთ ყველაფერი რაც იცით ფუნქციების შესახებ: რა არის? რატომ ვიყენებთ? რაში გვეხმარება და სხვა

def sum(num1, num2):
    print(num1+num2)
    
sum(2,7)
sum(62,66)
sum(552,74)
sum(25454,7555)
sum(56562,557)
sum(52,7)

# ფუნქცია იმუშავებს მხოლოდ მაშინ როდესაც გამოვიძახებთ მას, გადაეცემა მა1სიმუმ 2 პარამეტრი, 
# არგუმენტიც შესაბამისად უნდა იყოს 2. ფუნქცია შეგვძლია გამოვიყენოთ ბევრჯერ,