// // 1)შექმენი ფუნქცია sumArray(arr), რომელიც მიიღებს რიცხვების სიას პარამეტრად და დააბრუნებს სიაში მყოფი რიცხვების  ჯამს.

function sumArray(arr){
    sum1=0
    for(let i=0; i<arr.length;i++){
        sum1+=arr[i]
    }
    console.log( sum1); 


}

sumArray([22,2,3,1])
// sumArray([34,12,67,65])
// sumArray([1,2,3,4*2])








// 7)შექმენი ფუნქცია რომელსაც არგუმენტად გადაეცემა სია,შენი დავალებაა რომ ამ სიიდან გამოიტანო თითეული ელემენტი ცალ ცალკე,გამოიყენე for loop/while loop

// 8)შექმენი ფუქნცია რომელსაც გადაეცემა არგუმენტად სია,სადაც მოთავსებული იქნება განსხვავებული მონაცემთა ტიპის ელემენტები,შენი დავალეაბა რომ --> დაითვალო ამ სიაში სტრინგ ტიპის მონაცემების რაოდენობა და ინტეჯერ ტიპის მონაცემების ჯამი, ანუ სიაში უდნა დათვალო რამდენი სტრინგია,და ინტეჯერის შემთხვევაში უნდა გაიგო სიაში მყოფი ინტეჯერების(ნამბერების) ჯამი

// 9)შექმენი ფუნქცია რომელსაც გადაეცემა რიცხვებით სავსე სია,შენი დავალებაა რომ გაიგო ამ სიაში მყოფი ლუწი რიცხვების რაოდენობა და კენტი რიცხვების ჯამი

// 10)შექმენი ფუნქცია რომელსაც გადაეცემა სტრინგები და ინტეჯერები,შენი დავალებაა რომ თუ სიაში მყოფი რომელიმე ელემენტი არის სტრინგ ტიპის,ასეთი ელემენტი ჩაანაცვლო true - ით