// // 1)შექმენი ფუნქცია sumArray(arr), რომელიც მიიღებს რიცხვების სიას პარამეტრად და დააბრუნებს სიაში მყოფი რიცხვების  ჯამს.

function sumArray(arr){
    sum1=0
    for(let i=0; i<arr.length;i++){
        sum1+=arr[i]
    }
    console.log( sum1); 


}

sumArray([22,2,3,1])
// sumArray([34,12,67,65])
// sumArray([1,2,3,4*2])







// 10)შექმენი ფუნქცია რომელსაც გადაეცემა სტრინგები და ინტეჯერები,შენი დავალებაა რომ თუ სიაში მყოფი რომელიმე ელემენტი არის სტრინგ ტიპის,ასეთი ელემენტი ჩაანაცვლო true - ით