// 6)შექმენით ფუნქცია რომელსაც გადასცემთ არგუმენტად სიას --> ["გიორგი" , 14 , "საბა" , 90.5 , "ირაკლი" , true]
// ---შენი დავალებაა რომ ამ სიაში მყოფი მესამე ინდექსზე მდგომი ელემენტი შეცვალო --> 10.89 ით
// ---შენი დავალებაა რომ ამ სიაში მყოფი მეხუთე ინდექსზე მდგომი ელემენტი შეცვალო ---> false ით
// ---შენი დავალებაა რომ ამ სიაში მყოფი პირველ ინდექსზე მდგომი ელემენტი შეცვალო ---> "ირაკლი" ით
// ---ამ ყველა ელემენტის შეცვლის შემდეგ დააკონსოლლოგეთ საბოლოო სია 

function array(arr){
    for(i=0; i<arr.length; i++){
        arr[3]==10.89
        arr[arr.length-1]=false
        arr[1]='irakli'
    }console.log(arr)
}
array( ["გიორგი" , 14 , "საბა" , 90.5 , "ირაკლი" , true])