// 8)შექმენი ფუქნცია რომელსაც გადაეცემა არგუმენტად სია,სადაც მოთავსებული იქნება განსხვავებული მონაცემთა ტიპის ელემენტები,შენი დავალეაბა რომ --> დაითვალო ამ სიაში სტრინგ ტიპის მონაცემების რაოდენობა და ინტეჯერ ტიპის მონაცემების ჯამი, ანუ სიაში უდნა დათვალო რამდენი სტრინგია,და ინტეჯერის შემთხვევაში უნდა გაიგო სიაში მყოფი ინტეჯერების(ნამბერების) ჯამი

function array2(arr){
    let str=0
    let numSum=0
    for(i=0; i<arr.length; i++){
         if(typeof arr[i]== 'string'){
             str++
         }else if(typeof arr[i] == 'number'){
            numSum +=arr[i]
         }
    }console.log(str, numSum)
}

array2(['giorgi', false, 55.6, 54,'string'])