// 2)მომხმარებელს შემოატანინე რიამე რიცხვი 1იდან 10 მდე,თუ მომხმარებლის მიერ შემოტანილი რიცხვი არის ლუწი,მაგ შემთხვევაში დაატრიალეთ ფორ ლუპი და ამ რიცხვიდან 50 მდე გამოიტანეთ ყველა ლუწი რიცხვი,და თუ მომხმარებლის მიერ შემოტანილი რიცხვი არის კენტი,მაშინ დაატრიალეთ WHILE LOOP ამ რიცხვიდან 50 მდე და გამოიტანეთ ყველა კენტი რიცხვი



function eveoOdd() {
    let num = Number(prompt('1-10 chawere'));
    if (num>=1 && num <= 10) {
        if (num%2===0) {
            for (let i = num; i <= 50; i++) {
                if (i % 2 === 0) {
                    console.log(i, 'luwi');
                }
            }
        } else {
            let i = num;
            while (i <= 50) {
                if (i % 2 !== 0) {
                    console.log(i, 'kenti');
                }
                i++;
            }
        }
    } else {
        console.log('1dan 10mde sheiyvane');
    }
}
eveoOdd();
