// 1)შექმენი ობიექტი person, რომელსაც ექნება ველები: name, age, city.
// კონსოლში გამოიტანე მხოლოდ name და city.

let person ={
    name : 'lasha',
    age : 24,
    city : 'batumi',
}

console.log(person.name, person.city)

console.log('---------------------------')



// 10)შექმენით ობიექტი რომელიც იქნება ცარიელი,შენი დავალებაა რომ ამ ობიექტშ დაამატო 5 property,შემდეგ დააკონსოლლოგეთ(რომ შეამოწმოთ შეივსო(დაემატა)თუ არა ,და ამის შემდეგ ამოშალოთ 2 property (ბოლოს დააკონსოლლოგეთ რომ ნახოთ ამოიშალა თუარა)

// 11)შექმენი ობიექტი phone = {brand: "Apple"}
// დაამატე model და price ველები, შემდეგ ტერმინალში გამოიტანეთ ყველა value სიის სახით და ასევე ყველა key სიის სახით

// 12)შექმენი ობიექტი --> car = {"car brand" : "bmw" , "car model" ; "g30" , "car year" : "2013" }
// ცონსოლში გამოიტანე ცალ ცალკე ყველა value გამოიყენეთ მეორე გზა რომელიც ვისწავლეთ ობიექტიდან ელემენტის წამოსაღებად

// 13)აუცილებლად
// გადახედეთ რესურსებს