# level 26:
#      1) შექმენით სია რომელშიც მოათვსებთ 10 განსხვავებულ მანქანის სახელს, შემდეგ დაბეჭდეთ ცალ ცალკე 
# მეორე და მეხუთე ელემენტები, დაბეჭდეთ თავიდან შუამდე ყველა ელემენტი, დაბეჭდეთ შუიდან ბოლომდე ყველა ელემენტი,
#  დაბეჭდეთ მინუს 3 ინდექსზე და -1 ინდექსზე მდგომი ელემენტი, დაბეჭდეთ შუა სამი ელემენტი, დაბეჭდეთ მთლიანი სია


list=['bmw', 'mercedes', 'minikooper', 'audi', 'lamborgini', 'ferarri', 'bmw', 'hiyndai']
print(list[1])
print(list[4])
print(list[0:len(list)//2])
print(list[len(list)//2:len(list)])
print(list[-3])
print(list[-1])

