// 1)მომხმარებელს შემოატანინე რიცხვი (1–7).
// switch–case გამოყენებით გამოიტანე შესაბამისი კვირის დღე.
// თუ სხვა რიცხვია → "არასწორი დღე".

// 2)მომხმარებელს შემოატანინე თვის ნომერი (1–12).
// switch–case გამოყენებით განსაზღვრე სეზონი:

// 12,1,2 → ზამთარი

// 3,4,5 → გაზაფხული

// 6,7,8 → ზაფხული

// 9,10,11 → შემოდგომა

// 3)მომხმარებელს შემოატანინე:

// პირველი რიცხვი

// ოპერატორი (+, -, *, /)

// მეორე რიცხვი

// switch–case გამოყენებით შეასრულე ოპერაცია.
// თუ ოპერატორი არასწორია → "არასწორი ოპერატორი".

// 4)მომხმარებელს შემოატანინე ქულა (0–100).
// switch(true) <--მოიძიეთ ///// გამოიყენე და დააბრუნე:

// 90–100 → A

// 80–89 → B

// 70–79 → C

// 60–69 → D

// <60 → F

// 5)მომხმარებელს შემოატანინე ტექსტი:
// "car", "bus", "bike", "train"

// switch–case გამოყენებით დაბეჭდე შესაბამისი აღწერა.
// default შემთხვევაში → "უცნობი ტრანსპორტი".

// 6)მომხმარებელს შემოატანინე რიცხვი.
// switch(true) გამოყენებით განსაზღვრე:

// თუ არის 0

// თუ არის ლუწი

// თუ არის კენტი

// 7)ცვლადი role:
// შეამოწმე თუ ცვლადში ინახება შემდეგი მნშვნელობები გამოიტანე შესაბამისი ტექსტი

// "admin"

// "user"

// "guest"

// switch–case-ით განსაზღვრე წვდომა.
// თუ სხვა მნიშვნელობაა -> default ->
// "როლი არ არის განსაზღვრული"

// 8)მომხმარებელს შემოატანინე ფერი:
// "red", "green", "blue"

// switch–case-ით დაბეჭდე შესაბამისი ტექსტი.
// თუ სხვა ფერია → default →
// "ასეთი ფერი სისტემაში არ არის"





// <------single-line function----->

// 9)დაწერე single-line arrow function, რომელიც იღებს ორ რიცხვს და აბრუნებს მათ ჯამს.

// 10)დაწერე single-line arrow function, რომელიც იღებს რიცხვს და აბრუნებს:

// "ლუწი" თუ ლუწია
// "კენტი" თუ კენტია
// (გამოიყენე ternary)

// 11)დაწერე single-line arrow function, რომელიც აბრუნებს გადაცემული რიცხვის კვადრატს.

// 12)დაწერე single-line arrow function, რომელიც იღებს ტექსტს და აბრუნებს მის სიგრძეს

// 13)დაწერე single-line arrow function, რომელიც ტექსტს აბრუნებს მთლიანად დიდი ასოებით.

// 14)დაწერე single-line arrow function, რომელიც იღებს ასაკს და აბრუნებს

// "სრულწლოვანი" თუ >= 18
// "არასრულწლოვანი" თუ < 18

// 15)დაწერე single-line arrow function, რომელიც იღებს name და age-ს და აბრუნებს ობიექტს ამ ველებით