// // ```
// 1)მომხმარებელს შემოატანინე რაიმე რიცხვი,1 დან მომხმარებლის შემოტანილ რიცხვამდე დათვალე 
// თუ რამდენი ლუწი და რამდენი კენტი რიცხვია
let userNum = Number(prompt("Enter number"));
let even = 0;
let odd = 0;

let i = 1; 

while (i <= userNum) {
    if (i % 2 === 0) {
        even++
    } else {
        odd++
    }
    i++
}

console.log("Even numbers :", even);
console.log("Odd numbers :", odd);





// 5)შექმენი ცვლადი სადაც მომხმარებელს შემოატანინებ სტრინგს(პაროლს),ასევე შექმენი ცვლადი სადაც შეინახავ პაროლს,შემდეგ შეამოწმე,თუ მომხმარებლის შემოტანილი პაროლი არის იგივე პაროლი რაც შენ შეინახე ცვლადში,დაუპრინტე --> "you guessed" , სხვა შემთხვევაში დაგჭირდებათ ვაილ ლუპი რომელიც გააკეთებს შემოდეგ მოქმედებას --> სანამ მომხმარებლის პაროლი არ იქნება თქვენს მიერ შენახული პაროლისა,იქამდე გაუმეორეთ რომ თავიდან შემოიყვანოს მომხმარებელმა პაროლი,თუ პაროლი გაარტყა მაშინ აქაც დაუკონსოლლოგეთ --> "you guessed"

// 6)მომხმარებელს შემოატანინე რიცხვი,სანამ მომხმარებელი არ შემოიტანს 0 იანს იქამდე  შეამოწმეთ -->თუ მომხმარებლის შემოტანილი რიცხვი არის უარყოფითი დაუკონსოლლოგეთ --> "negative number" , თუ მომხმარებელმა შემოიტანა დადებითი რიცხვი დაუკონსოლლოგეთ --> "You entered posotive number" ,ამის შემდეგ კი თავიდან მოსთხოვეთ რომ შშემოიტანოს რიცხვი მომხმარებელმა,თუ შემოიტანა მომხმარებელმა 0 ეს იმას ნიშნავს რომ ვაილ ლუპი არ იმუშავებს და ქვემოთ მის გარეთ დაუკონსოლლოგეთ -- > "you guessed the number,the loop is over" ```\
