// // ```
// 1)მომხმარებელს შემოატანინეთ სტრინგი,თქვენი დავალებაა შეამოწმო,თუ მომხმარებლის მიერ შემოყვანილი სახელის პირველი ასო არის "g" მაშინ დაუკონსოლლოგე რომ შენ ხარ "chad" სხვა შემთხვევაში დააკონსოლლოგე რომ "still chad"(ყვემ უნდა იცოდეთ გახსენების გარეშე თუ როგორ მიწწვდეთ სტრინგშ რომელიმე ასოს ცალკე თუ არა და მოიძიეთ)

// 2)მომხმარებელს შემოატანინეთ სახელი და რიცხვი,შემდეგ შეამოწმეთ,თუ მომხმარებლის მიერ შემოტანილი სახელი არის "გიორგი" და მომხმარებლის მიერ შემოტანილი რიცხვი არის 18 ზე მეტი მაშნ დაუკონსოლლოგეთ "your name is giorgi and you are adult" თუ მომხმარებლის მიერ შემოტანილი სახელი არის ნიკა და ასაკი არის 18 ზე ნაკლები და 11 ზე მეტი დაუკონსოლლოგეთ რომ "your name is nika and you are younger" თუ მომხმარებლის მიერ შემოტანილი სახელი არის "saba" ან "irakli" და ასაკი არის 11 ზე ნაკლები და 5 ზე მეტი მაშინ დაუკონსოლლოგეთ რომ "you have nice name but you are too young" სხვა შემთხვევაში დაუპრინტე რომ you are not born yet D

// 3)დაატრიალეთ ფორ ციკლი 1 დან 60 ჩათვლით,შენი დავალებაა კონსოლში გამოიტანო მხოლოდ ისეთი რიცხვების ჯამი რომელიც უნაშთოდ იყოფა 3 ზეც და 5 ზეც ერთად, მაგალითად ასეთრიცხვებია 15 , 30 ...


// 4)დაატრიალეთ for loop 40 დან 1 მდე უკუღმა(სცადეთთუ არა და მოიძიეთ)

// 5)მომხმარებელს შემოატანინეთ რაიმე რიცხვი(მაგრამ ეს რიცხვია არ ვიცით სტრინგია თუ ნამბერი) შენი დავალებაა შეამოწმო თუ მომხმარებლის მიერ შემოტანილი რიცხვის ტიპი არის სტრინგი მაშინ დაუკონსოლლოგე რომ "you entered string number,so you are wrong" სხვა შემთხვევაში ანუ თუ მომხმარებელმა შემოიტანა რიცხხვი რომლის ტიპი არის number მაშინ დაატრიალეთ ფორ ციკლი 1 დან ამ რიცხვამდე და გამოიტანეთ ყველა კენტი რიცხვი კონსოლში(წინაზე ვისაუბრეთ ფუნქციაზე რომელიც იგებდა ელემენტის ტიპს,გაიხსენეთ თუა რადა მოიძიეთ,მე არ მომწეროთ არ დაგეხმარებით იჭყლიტეთ თავები ამ დავალებებზე,you will gain skill of looking up something by yourself <3 :D```