
# 1)შექმენით ორი განსხვავებული ცვლადი ერთში შეიყვანთ თქვენს სახლეს ხოლო მეორეში თქვენს გვარს შემდენგ კი თითოეული მათგანი დაპრინტეთ შემდეგ კი კომენტარების დახმარებით



#name="Diana "
#Surname="Dzukaevi "

#print(name + Surname)

# 2) შექმენით რამდენიმე ცვლადი სადაც შეინახავთ თქვენს შესახებ ინფორმაციას


name = "Diana  "
surname="Dzukaevi, "
city="Tbilisi, "
academy="GOA, "
age=17

# 3) გამოიტანეატ ტერმინალში თქვენს შესახებ იფნორმაცის ცვლადების დახმარებით ერთ გრძელ წინადადებად


print("I am", name + surname, "i live in", city, "I study at", academy, "I am", age, "years old.")

# 4) კომენტარებით ახსენით თუ როგორ ვქმნით ცვლადს და რა არის მისი დანიშნულება


# ცვლადს ვქმნით მიმნიჭებელი ტოლობით, და შემდგომ ვანიჭებთ მიშვნელობას. მაგ: სტრინგი, 
# ინტეგერი და ა,შ.  ცვლადს ყოველთვის ვიწყებთ ტექსტით, არა რიცხვით

