// // 2)შექმენით ფუნქცია რომელსაც გადაეცემა სტრინგების სია,სადაც მოთავსებული იქნება 10 სტრინგი,
// // შენი დავალებაა რომ -->
// // ---გაიგო ამ სიის სიგრძე
// // ---გამოიტანო მე3 ინდექსიდან მე8 ინდექსამდე ელემენტები
// // ---გამოიტანო მე 4 ე ინდექსიდან 3 ელემენტი

// // 3)შექმენი ფუნქცია,გადაეცი ორი სია,ერთი სტრინგების ერთ რიცხვების,შენი დავალებაა რომ გააერთიანო ეს ორი სია ერთმანეთში და მასე დააბრუნო
function list1(arr) {
    console.log( arr.length)
    console.log(arr.slice(3, 9))
    console.log(arr.splice(4, 3))
}


list1( ["a232","b2312323","23123c","333","dsadsa","fsadasda","ffffg","lll","eewe","fdsfj"])
console.log('<--------------------------------------->')

function lists(strs, nums) {
    let both = strs.concat(nums)
    console.log(both) 
}


lists(["giorgi", "nino", "ana"],[1, 2, 3, 4])
