// unshift + shift----
// ფუნქციამ მიიღოს სია.
// დასაწყისში ჩასვას "hello",
// შემდეგ წაშალოს პირველი ელემენტი.
// დააბრუნოს მიღებული სია.
// concat + length----
// ფუნქციამ მიიღოს ორი სია. გააერთიანოს და დაბეჭდოს გაერთიანებული სიის სიგრძე.

function deleting(array){
    kksijdasiojdasiojdsdSAIODJ IOAJASI ,msd
}


// ყველა ერთად----
// ფუნქციამ მიიღოს სია.
// დასაწყისში ჩასვას "A"
// ბოლოში ჩასვას "Z"
// წაშალოს პირველი ელემენტი
// წაშალოს ბოლო ელემენტი
// სხვა მეორე სიასთან გააერთიანოს(შექმენით თქვენით ახალი სია)
// დაბეჭდოს: "საბოლოო სიის სიგრძე არის: ... და საბოლოო სიაა ..."