// 2)რა განსხვავებაა getElementById , getElementByClassName , getElementByTagName შორის დაწერე კომენტარის სახით და ახსენი ყველაფერი რაც იცი თითიეულ მათგანზე 

// getElementById არის უნიკალური რადგან  Id  შეგვიძ₾ია გავუწეროთ მხოლოდ ერთ ელემენტს, შესაბამისად სხვა მეთოდებისგან  განსხვავებით მოაქვს მხოლოდ ერთი ელემენტი და ცვლადში ინახება ერთ ელემენტი.

// getElementByTagName მეთოდი გამოიყენება მაშინ როდესაც გვინდა რომ დოკუმენტშ არსებული კონკრეტული ყველა თეგი მისი სახელით იქნეს შენახულ ჩვენს მიერ შექმნილ სიაში,

// getElementByClassName მეთოდით შეგვიძ₾ია დოკუმენტიდან წამოვიღოთ ყველა ის ელემენტიო რომელსაც აქვს ამ მეთოდისთის 
// მითთბული კლასი, ასევე ინახება სიაში.

// 3)კომენტარის სახით ახსენით თუ რა განსხვავებაა innerText,innerHTMl,textContent ს შორის,შეგიძლიათ მოიძიოთ ინფორმაცია ამ სამი ტექნიკის შესახებ და ნახოთ დამატებითი ინფორმაციაც

// innerText ფროფერთი წვდება თეგში არსებულ ტექსტს.
// innerHTMl  წვდება თეგის შიგნით არსებულ HTML კოდს სტრინგის სახით ანუ შგვიძ₾ია ჩვეულებრივად დავწეროთ ნებისმიერი  HTML და CSS კოდიც.

// textContent ფროფერთი წვდება თეგში არსებულ ტექსტს.