// // 1)დავალება 1 – ლუწი/კენტი მთვლელი
// მომხმარებელს prompt–ით შეეკითხე ორი რიცხვი: start და end.
// გამოიყენე for ციკლი, რომ გაიარო ყველა რიცხვი start-იდან end-მდე.
// დაითვალე ცალ–ცალკე რამდენია ლუწი და რამდენია კენტი.
// ბოლოს დაბეჭდე: "ლუწების რაოდენობა: X, კენტების რაოდენობა: Y".
let evenCount = 0
let oddCount = 0

let start = Number(prompt("Enter start number"))
let end = Number(prompt("Enter end number"))

for (let i = start; i <= end; i++) {
  if (i % 2 === 0) {
    evenCount++
  } else {
    oddCount++
  }
}

console.log("ლუწების რაოდენობა:", evenCount)
console.log("კენტების რაოდენობა:", oddCount)




// 5)prompt–ით მომხმარებელს შეეკითხე სამი რიცხვი.

// გამოიყენე if/else რომ იპოვო:

// ყველაზე დიდი რიცხვი

// ყველაზე პატარა რიცხვი

// შემდეგ შეამოწმე:

// თუ ყველაზე დიდი რიცხვი ლუწია → დაბეჭდე "ყველაზე დიდი რიცხვი ლუწია"

// თუ კენტია → "ყველაზე დიდი რიცხვი კენტია"