// 1)შექმენით ერთი სეტი სადაც მოათავსებთ რამდენიმე ელემენტს(ერთნაირი
//  ელემენტები მეორდებოდეს რამდენჯერმე)

// შენი დავალებაა რომ სეტში დაამატო რამდენიმე განსხვავებული 
// ელემენტი(გამოიყენე CHAIN + მეთოდი)

// შემდეგ ამოშალე ის ელემენტი სეტიდან რომელიც 
// პირველია სეტში

// შემდეგ შეამოწმე არის თუ არა თქვენთვის სასურველი ელემენტი სეტში

// შემდეგ კონსოლში გამოიტანე სეტის სიგრძე

// შემდეგ შექმენი ცვლადი და
//  გამოიყენე ENTRIES მეთოდი სეტზე,
// ამის შემდეგ გადაუარე FOREACH ით და 
// გამოიტანე წყვილად(სიებად)

// ამის შემდეგ გაასუფთავეთ მთლიანი სეტი

let seti = new Set([22, 22, 4, 4, 55, 55, 6, 6, 6]).add(100).add(200).add(300)

seti.delete(22)
console.log(seti)
console.log(seti.has(55))
console.log(seti.size)

let setEntries = seti.entries()

seti.forEach((value, key) => {
console.log([key, value])
})

seti.clear()
console.log(seti)