// 3)შექმენი ფუნქცია,რომელსაც გადაეცემა ორი პარამეტრი , num1 და num2 , შენი დავლებაა რომ კონსოლში გამოიტანო ამ ორი რიცხვის ჯამი,გამოიძახე ფუნქცია 5 ჯერ და გადაეცი სხვადასხვა მნიშვნელობებია რგუმენტად

function numbers(num1,num2){
    console.log( num1+num2)
}

numbers(22,3)
numbers(242,445343)
numbers(2545432,3)
numbers(622222,4444444443)
numbers(666622,873)



// 4)შექმენით ფუნქცია რომელსაც გადაეცემა ერთ პარამეტრი --> num1 ,შენი დავალებაა რომ დაატრიალო ფორ ლუპი 1 დან ამ პარამეტრში გადაცემულ ცვლადამდე(რიცხვამდე) და გამოიტანო თითეული რიცხვი კონსოლში,შემდე გამოიძახეთ ფუნქცია და არგუმკენტად გადაეცით სასურველი რიცხვი,გამოიძახეთ ფუნქცია 5 ჯერ და არგუმენტად გადაეცით განსხვაავებული რიცხვები

function number(num1){
    for(i=1; i<=num1; i++)
        console.log(i)
}
number(3)
number(8)
number(28)
number(88)
number(70)