// 1)დაწერე ფუნქცია, რომელიც იღებს არგუმენტად რიცხვების სიას და ახალ სიაში ამატებს მხოლოდ ლუწ რიცხვებს. შემდეგ იპოვეთ ამ სიაში მყოფი რიცხვების ჯამი
function func(numbersList){
    let evensList=[]
    i=0
    while(i<numbersList.length){
        if(numbersList[i]%2==0){
            evensList.push(numbersList[i])
        }
        i++
    }
    let sum=0
    for(i=0;i<evensList.length;i++){
        sum+=evensList[i]
    }
    return sum
}

console.log(func([34,45,2,564,99,5]))



// 5)შექმენი ფუნქცია რომელიც იღებს სტრინგების სიას,შენი დავალებაა რომ შეამოწმო,თუ რომელიმე სტრინგის სიგრძე არის ლუწი რიცხვისგან შემდგარი მაშინ ასეთი სახელები ჩაამატეთ ახალ სიაში,ხოლო თუ რომელიმე სტრინგის სიგრძე არის კენტი რიცხვისგან შემდგარი ასეთი სტრინგები შეცვალე false მნიშვნელობით

// 6)დაწერე ფუნქცია, რომელიც იღებს სტუდენტების სახელების სიას და აბრუნებს(ითვლის) რამდენი სახელი იწყება ასო „გ“-ზე.

// 7)შექმენი ფუნქცია, რომელიც იღებს რიცხვების სიას და აბრუნებს ახალ სიას მხოლოდ იმ რიცხვებისგან შემდგარს, რომლებიც ერთდროულად ლუწებიც არიან და 5-ის ჯერადებიც,შემდეგ ამ სიაში მყოფი კენტი რიცხვების ჯამი იპოვეთ

// 8)დაწერე ფუნქცია, რომელიც იღებს სახელების სიას და აბრუნებს ახალ სიას მხოლოდ იმ სახელებისგან შემდგარს, რომლებსაც სიგრძე 5-ზე მეტია და არის ლუწი.შემდეგ შეამოწმეთამ ახალ სიაში მყოფი სახელებიდან თუ რომელიმე იწყება ასო "ა" ზე ასეთი ელემენტები ამოშალეთ სიიდან(ამაში გამოიყენეთ splice ფუნქცია,თუ მიხვდებით როგორ)

// 9)შექმენით ფუნქცია რომელიც არგუმენტად იღებს ორ სიას(რიცხვების),თქვენი დავალებაა რომ იპოვოთ ორივე სიაში მყოფი რიცხვების ჯამი და შემდეგ შეადაროთ,თუ ამ ორი რიცხვის ჯამი მეტია 50 ზე და არის ლუწი მაშინ გამოიტანე შემდეგი ტექსტი --> "ორი რიცხვის ჯამი არის მაღალი და ეს რიცხვია ..." სხვა შემთხევაში გამოიტანეთ ---> 'ორი რიცხვის ჯამი არის ძალიან დაბალი და ეს რიცხვია ..."