// 9)შექმენით ფუნქცია რომელიც არგუმენტად იღებს ორ სიას(რიცხვების),თქვენი დავალებაა რომ იპოვოთ ორივე სიაში მყოფი რიცხვების ჯამი და შემდეგ შეადაროთ,თუ ამ ორი რიცხვის ჯამი მეტია 50 ზე და არის ლუწი მაშინ გამოიტანე შემდეგი ტექსტი --> "ორი რიცხვის ჯამი არის მაღალი და ეს რიცხვია ..." სხვა შემთხევაში გამოიტანეთ ---> 'ორი რიცხვის ჯამი არის ძალიან დაბალი და ეს რიცხვია ..."

function func (arr1, arr2){
    let sum1=0
    let sum2=0
    let i=0
    while(i<arr1.length){
        sum1+=arr1[i]
        i++
    }
    i=0
    while(i<arr2.length){
        sum2+=arr2[i]
        i++
    }
    let both=sum1+sum2
    if(both>50 && both%2==0){
        return `ორი რიცხვის ჯამი არის მაღალი და ეს რიცხვია ${both} `
    }else{
        return `ორი რიცხვის ჯამი არის ძალიან დაბალი და ეს რიცხვია  ${both} `
    }
}

console.log(func([5,5,5,5],[110,10,10]))
console.log(func([2,1,2,4],[5,0,1]))

number=3
console.log(String(number))
consoole.log(typeof(number))