// 1)კომენტარის სახით ახსენით და განმარტეთ რა არის DOM და რაში გვეხმარება იგი
// DOM-არის HTML დოკუმენტის ობიექტის მოდელი, რომლის საშუალებითაც შეგვიძლია JS-s ფაილშვე შვცვალოთ/
// წავშალოთ/დავამატოთ/მნიშვნელობა შევუცვალოთთ/გავხადოთ ინტერაქციული/შმივანიჭოთ სტილები
// HTML დოკუმენტში არსებულ ელემენტებს და ატრიბუტებ.

// 2)კომენტარის სახით ახსენით თუ რას გვიბრუნებს getElementByTagName("")
//  გვიბრუნებს HTML თაგებისგან შემდაგრ სიას


// 7)შექმენი 6 ცალი პარაგრაფი,წამოიღე ყველა პარაგრაფი tagName ის გამოყენებით და შეინახე ცვალადში,შემდეგ დააკონსოლლოგე იმ სიის სიგრძე რომელშიც ინახავ ყველა პარაგრაფს////ასევე ამ სიას გადაუარე for ციკლით და გამოიტანე თითოეული ელემენტის textContent ცალ ცალკე

// 8)შექმენი 5 ცალი i თეგი და მოათავსე რაიმე ტექსტი შიგნით,შენი დავცალებაა რომ წამოიღო ყველა i თეგი და შეინახო ცვლადში,შენი დავალებააა რომ ყველა i თეგში მყოფი ტექსტი textContent ის გამოყენებით შეცვალო --> "viri" ით /გამოიყენე while loop/for loop ორივე

// 9)დააგენერირე რენდომ მთელი რიცხვები 50 დან 100 ჩათვლით/////1 დან 10 ჩათვლით /// 5 დან 25 მდე///