// 1)დაატრიალეთ for loop 25 ჯერ და გამოიტანეთ თქვენი სახელი და გვარი ასეთ ფორმატში -->
// 1 გოგა
// 2 გოგა
// 3 გოგა
// ...

// for(let i=0; i<26; i+=1){
//     console.log(i,'diana dzukaevi')
// }

// let  i=1
// while (i<=25){
//     console.log(i,'diana dzukaevi')
//     i=i+1
// }


// 2)1 დან 100 მდე დაბეჭდეთ ყველა ლუწი რიცხვი

// 3)1 დან 100 მდე დაბეჭდეთ ყველა კენტი რიცხი

// 4)1 დან 100 მდე დაბეჭდეთ ყველა რიცხვი მაგრამ თთოეულს მიუწერეთ გვერდით ლუწია თუ კენტი მაგ:

// 1 კენტი
// 2 ლუწი
// 3 კენტი
// 4 ლუწი


// for(let i = 1; i <= 100; i=i+1) {
//     if (i % 2 === 0) {
//         console.log(i);
//     } 
// }


// for(let i = 1; i <= 100; i=i+1) {
//     if  (i % 2 === 1) {
//         console.log(i)
//     }
// }

// for(let i = 1; i <= 100; i=i+1) {
//     if (i % 2 === 0) {
//         console.log(i, 'even');
//     } 
//     else if  (i % 2 === 1) {
//         console.log(i,'odd')
//     }
// }

// 5)1 დან 30 ჩათვლით დაბეჭდეთ ყველა ლუწი რიცხვის ჯამი
// let jami=0
// for(let i = 1; i<30; i+=1){
//     if (i%2==0){
//         jami+=i
//     }
// }
// console.log(jami);

// 6)მომხმარებელს შემოატანინე 2 რიცხვი,num1 და num2, დაატრიელე ფორ ციკლი მომხმარებლის მიერ შემოტანილი პირველი რიცხვიდან მომხმარებლის მიერ შემოტანილ რიცხვამდე და გამოიტანე რიცხვები ამ დიაპაზონში
let num1 = Number(prompt('num1'));
let num2 = Number(prompt('num2'));
for (let i = num1; i <= num2; i += 1) {
    console.log(i);
}

