// 1)მომხმარებელს შემოატანინე რიცხვი და გამოიტანე მისი მთელი ნაწილი Math.floor()-ის გამოყენებით.
let userNum=Number(prompt('enter number'))
let mathFloor=Math.floor(userNum)
console.log(
    'originall num:', userNum,
    'floored:', mathFloor
)






// 8)მომხმარებელს შემოატანინე რიცხვი და გამოიტანე მისი ხარისხი (მაგ. კვადრატი ან კუბი) Math.pow()-ის გამოყენებით.

// 9)დააგენერირე 5 შემთხვევითი მთელი რიცხვი 1-დან 100-მდე და იპოვე ამ რიცხვებიდან
// მინიმალური და მაქსიმალური მნიშვნელობა Math.random(), Math.floor(), Math.min() და Math.max()-ის გამოყენებით.

// 10)მომხმარებელს შემოატანინე რიცხვი და გამოიტანე:

// მისი კვადრატი (Math.pow()),

// ფესვი (Math.sqrt()),

// დამრგვალებული მნიშვნელობა (Math.round()).
// ყველა შედეგი ცალ-ცალკე გამოიტანე console.log()-ით.

// 11)შექმენი პატარა “მათემატიკური თამაში”:
// დააგენერირე შემთხვევითი რიცხვი 1-დან 10-მდე.
// მომხმარებელს შემოატანინე რიცხვი.
// თუ მომხმარებლის რიცხვი დაემთხვა დაგენერირებულს — გამოიტანე "სწორია!",
// სხვა შემთხვევაში "ცდები!".